#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "PRACTITIONER"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.LICENCE-STATUS.module.client-roles.keycloak_role.ROLES["get-org"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MOA"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-dmft-service"] will be destroyed
  # (because key ["USER-MANAGEMENT-SERVICE/view-client-dmft-service"] is not in for_each map)
  - resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      - client_id = "f2d7cc73-3c77-44e0-b6fb-cec2ea545629" -> null
      - id        = "moh_applications/client/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/c0d04c50-7dc9-4156-909d-5b991b94a867" -> null
      - realm_id  = "moh_applications" -> null
      - role_id   = "c0d04c50-7dc9-4156-909d-5b991b94a867" -> null
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-dmft-webapp"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "f2d7cc73-3c77-44e0-b6fb-cec2ea545629"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-licence-status"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "f2d7cc73-3c77-44e0-b6fb-cec2ea545629"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-dmft-service"] will be destroyed
  # (because key ["USER-MANAGEMENT-SERVICE/view-client-dmft-service"] is not in for_each map)
  - resource "keycloak_openid_client_service_account_role" "ROLE" {
      - client_id               = "2ddc7173-34f3-41ff-9beb-66c7802717ce" -> null
      - id                      = "9ab20ecc-c39f-45d4-992c-8290579a247d/c0d04c50-7dc9-4156-909d-5b991b94a867" -> null
      - realm_id                = "moh_applications" -> null
      - role                    = "view-client-dmft-service" -> null
      - service_account_user_id = "9ab20ecc-c39f-45d4-992c-8290579a247d" -> null
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-dmft-webapp"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "2ddc7173-34f3-41ff-9beb-66c7802717ce"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-client-dmft-webapp"
      + service_account_user_id = "9ab20ecc-c39f-45d4-992c-8290579a247d"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-licence-status"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "2ddc7173-34f3-41ff-9beb-66c7802717ce"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-client-licence-status"
      + service_account_user_id = "9ab20ecc-c39f-45d4-992c-8290579a247d"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-dmft-service"] will be destroyed
  # (because key ["view-client-dmft-service"] is not in for_each map)
  - resource "keycloak_role" "ROLES" {
      - attributes = {} -> null
      - client_id  = "2ddc7173-34f3-41ff-9beb-66c7802717ce" -> null
      - id         = "c0d04c50-7dc9-4156-909d-5b991b94a867" -> null
      - name       = "view-client-dmft-service" -> null
      - realm_id   = "moh_applications" -> null
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-dmft-webapp"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "2ddc7173-34f3-41ff-9beb-66c7802717ce"
      + id        = (known after apply)
      + name      = "view-client-dmft-webapp"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-licence-status"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "2ddc7173-34f3-41ff-9beb-66c7802717ce"
      + id        = (known after apply)
      + name      = "view-client-licence-status"
      + realm_id  = "moh_applications"
    }

Plan: 10 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sharpedavid, Action: `pull_request`*